print("start")
import use
print(use.__version__)
mod = use("numpy", version="1.20.0", hashes={'Z賻鱢輄䇞岄村遁揼女鐸艼㓻縤斮譗擣灩', 'M粪小䩶汌结椶驔蝷湔鄣衾䐠洵㕢㷾廞诫', 'X㸕䛔㱷抾㡹孹悵髝暱㴶揻秚擬䀗緑罰䄱', 'J妢㳽蘀徹䡉矦皅䏇搪㡵渓呿脬祖読蕟蛩', 'g蠸䌐欌盜簴靕䧑㵃滣造藻鱥鷸梠譿嬼曑', 'S瞅㮭衋㿤消ª冎鎉螯䬈训拑䄒窽鐀㙳㵲', 'O㑓唒篯堼骞䏕铏乤謾隋屡錩攈䲭㧖檏婈', 'L㴵恡䅳嚔伅烕刟荵穠骺疃䑡哔籯從Ǣ溷', 'W斡坒趖噅贁葑閮蔇韎㟴唎廁䧠斴遝䕴䰿', 'h盪有谓壶㴯庺馊埳笩蔔愯跟靳脔饄䭤瞁', 'G貣䙾挫愫䔎耻畛坣槥郦镾耗硛华膟槜鵊', 'S籭俼粀鄵暟孠橸塘㝕磳䶨麩禪䘬㜡㷀寵', 'i䤫鍊䖖鞺熶埧㧈郣缫煎筘鲇扜勻猣欂檏', 'W㣧㢸囝儔跻仅蠓㭤鐁颟眛釷損祎羓䖕÷', 'G单爈㐂賘戉猾逈闓箐鏷䔿玒偮鉤蓒綳㶟', 'Z猌㞲磚毆滷呥繥粔䡝䰪磤ó鮒鸻吞嘇譐', 'K䊒戆踩胘贤㣭闒汱县棬焗䤔㺄硬钚猠䨗', 'I珧紘䁎溘鉐㥑猉虴忚餝鈿夙僱簞渙䧁藗', 'T篥塬䰜怎替津馶珩輊䤫犈䃯憩Ȉ爺漦巿', 'i腽慦舛袕甝遟浥㷾莘膫絼訜犽剭歁攔涭', 'W鹆唈羁袴枍䢡䐈絢躲棤狳㥯飇礒㔤湑缪', 'H禸婩銴s灦菒猖驈諶攇疂銗熶稼姥呓䳠', 'Z䒒旘渧皶䗠勯㾰䞻鵣侎邯臘懼渷蝚騽㧱', 'j㐈䥪鹻餥覩爻㢧㥾藞㪊靣㣍箖蓥䗤㯡榅'}, modes=use.auto_install)
print("fin")